atsamd-rs/atsamd/svd/ATSAMC20N18A.svd
            <cluster>
               <name>USART_INT</name>
               <description>USART INTERNAL CLOCK Mode</description>
               <alternateCluster>I2CM</alternateCluster>
               <headerStructName>SercomUsart_int</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>USART_INT Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>USART_EXT_CLK</name>
                              <description>USART with external clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_INT_CLK</name>
                              <description>USART with internal clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI in slave operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI in master operation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C slave operation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C master operation</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run during Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IBON</name>
                        <description>Immediate Buffer Overflow Notification</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPR</name>
                        <description>Sample</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>SAMPRSelect</name>
                           <enumeratedValue>
                              <name>16X_ARITHMETIC</name>
                              <description>16x over-sampling using arithmetic baudrate generation</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>16X_FRACTIONAL</name>
                              <description>16x over-sampling using fractional baudrate generation</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>8X_ARITHMETIC</name>
                              <description>8x over-sampling using arithmetic baudrate generation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>8X_FRACTIONAL</name>
                              <description>8x over-sampling using fractional baudrate generation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>3X_ARITHMETIC</name>
                              <description>3x over-sampling using arithmetic baudrate generation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXPO</name>
                        <description>Transmit Data Pinout</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TXPOSelect</name>
                           <enumeratedValue>
                              <name>PAD0</name>
                              <description>SERCOM PAD[0] is used for data transmission</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD2</name>
                              <description>SERCOM PAD[2] is used for data transmission</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RXPO</name>
                        <description>Receive Data Pinout</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>RXPOSelect</name>
                           <enumeratedValue>
                              <name>PAD0</name>
                              <description>SERCOM PAD[0] is used for data reception</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD1</name>
                              <description>SERCOM PAD[1] is used for data reception</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD2</name>
                              <description>SERCOM PAD[2] is used for data reception</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD3</name>
                              <description>SERCOM PAD[3] is used for data reception</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SAMPA</name>
                        <description>Sample Adjustment</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>FORM</name>
                        <description>Frame Format</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>FORMSelect</name>
                           <enumeratedValue>
                              <name>USART_FRAME_NO_PARITY</name>
                              <description>USART frame</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_FRAME_WITH_PARITY</name>
                              <description>USART frame with parity</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_FRAME_LIN_MASTER_MODE</name>
                              <description>LIN Master - Break and sync generation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_FRAME_AUTO_BAUD_NO_PARITY</name>
                              <description>Auto-baud - break detection and auto-baud</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_FRAME_AUTO_BAUD_WITH_PARITY</name>
                              <description>Auto-baud - break detection and auto-baud with parity</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CMODE</name>
                        <description>Communication Mode</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>CMODESelect</name>
                           <enumeratedValue>
                              <name>ASYNC</name>
                              <description>Asynchronous Communication</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC</name>
                              <description>Synchronous Communication</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPOL</name>
                        <description>Clock Polarity</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>CPOLSelect</name>
                           <enumeratedValue>
                              <name>IDLE_LOW</name>
                              <description>TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IDLE_HIGH</name>
                              <description>TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DORD</name>
                        <description>Data Order</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DORDSelect</name>
                           <enumeratedValue>
                              <name>MSB</name>
                              <description>MSB is transmitted first</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LSB</name>
                              <description>LSB is transmitted first</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>USART_INT Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CHSIZE</name>
                        <description>Character Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>CHSIZESelect</name>
                           <enumeratedValue>
                              <name>8_BIT</name>
                              <description>8 Bits</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>9_BIT</name>
                              <description>9 Bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>5_BIT</name>
                              <description>5 Bits</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>6_BIT</name>
                              <description>6 Bits</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>7_BIT</name>
                              <description>7 Bits</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SBMODE</name>
                        <description>Stop Bit Mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>SBMODESelect</name>
                           <enumeratedValue>
                              <name>1_BIT</name>
                              <description>One Stop Bit</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2_BIT</name>
                              <description>Two Stop Bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>COLDEN</name>
                        <description>Collision Detection Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SFDE</name>
                        <description>Start of Frame Detection Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENC</name>
                        <description>Encoding Format</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PMODE</name>
                        <description>Parity Mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>PMODESelect</name>
                           <enumeratedValue>
                              <name>EVEN</name>
                              <description>Even Parity</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ODD</name>
                              <description>Odd Parity</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXEN</name>
                        <description>Transmitter Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXEN</name>
                        <description>Receiver Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LINCMD</name>
                        <description>LIN Command</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLC</name>
                  <description>USART_INT Control C</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>GTIME</name>
                        <description>RS485 Guard Time</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>BRKLEN</name>
                        <description>LIN Master Break Length</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>HDRDLY</name>
                        <description>LIN Master Header Delay</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>USART_INT Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_FRAC_MODE</name>
                  <description>USART_INT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                     <field>
                        <name>FP</name>
                        <description>Fractional Part</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_FRACFP_MODE</name>
                  <description>USART_INT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                     <field>
                        <name>FP</name>
                        <description>Fractional Part</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_USARTFP_MODE</name>
                  <description>USART_INT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXPL</name>
                  <description>USART_INT Receive Pulse Length</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXPL</name>
                        <description>Receive Pulse Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
